{
  "introduceSudoku": {
    "title": "مرحبًا بك في لعبة السودوكو",
    "whatIsSudoku": "ما هو السودوكو",
    "answer": "السودوكو هي لعبة أحجية منطقية لوضع الأرقام. في السودوكو الكلاسيكية، الهدف هو ملء شبكة 9×9 بالأرقام بحيث تحتوي كل عمود وكل صف وكل من الشبكات الفرعية التسعة 3×3 التي تشكل الشبكة (والتي تسمى أيضًا 'صناديق' أو 'كتل' أو 'مناطق') على جميع الأرقام من 1 إلى 9. يوفر واضع الأحجية شبكة مكتملة جزئيًا، والتي لها حل واحد فقط إذا كانت الأحجية موضوعة بشكل جيد.",
    "ruleOfSudoku": "قواعد السودوكو",
    "rule1": "يجب أن يحتوي كل من الصناديق الفرعية التسعة 3×3 على الأرقام من 1 إلى 9، دون تكرار",
    "rule2": "يجب أن يحتوي كل صف على الأرقام من 1 إلى 9، دون تكرار",
    "rule3": "يجب أن يحتوي كل عمود على الأرقام من 1 إلى 9، دون تكرار",
    "rule4": "يجب أن يحتوي كل من الصناديق الفرعية التسعة 3×3 على الأرقام من 1 إلى 9، دون تكرار",
    "rule5": "يجب أن تظهر الأرقام من 1 إلى 9 مرة واحدة بالضبط في كل صف وعمود وصندوق فرعي 3×3",
    "howToPlay": "كيفية اللعب",
    "howToPlayAnswer1": "ابحث في الأحجية عن الأرقام السهلة. ابحث عن الصفوف أو الأعمدة أو الصناديق التي لها قيمة واحدة محتملة فقط لخلية ما. هذه تسمى 'الأحاديات'. املأ هذه الخلايا بالأرقام المناسبة.",
    "howToPlayAnswer2": "استخدم علامات القلم الرصاص لتدوين القيم المحتملة لكل خلية. أثناء حل الأحجية، قد تصادف خلايا لها أكثر من قيمة محتملة واحدة. ضع علامات على هذه الخلايا بالقلم الرصاص لتذكير نفسك بالاحتمالات.",
    "howToPlayAnswer3": "استخدم المنطق لاستبعاد القيم المستحيلة. ابحث عن الخلايا التي لا يمكن وضع قيمة معينة فيها لأنها ستنتهك قواعد السودوكو. على سبيل المثال، إذا كان الصف يحتوي بالفعل على الأرقام 1 و2 و3، فلا يمكن أن تحتوي أي خلية أخرى في ذلك الصف على هذه الأرقام.",
    "howToPlayAnswer4": "استخدم تقنيات متقدمة لحل الأحجية. مع اكتسابك المزيد من الخبرة في حل ألغاز السودوكو، يمكنك تعلم تقنيات متقدمة يمكن أن تساعدك في حل حتى أصعب الألغاز. بعض هذه التقنيات تشمل:",
    "howToPlayAnswer4.1": "X-Wing: تُستخدم هذه التقنية لاستبعاد القيم المستحيلة في الخلايا التي في نفس الصف أو العمود مثل خليتين تحتويان على نفس القيمة.",
    "howToPlayAnswer4.2": "Swordfish: تُستخدم هذه التقنية لاستبعاد القيم المستحيلة في الخلايا التي في نفس الصندوق مثل ثلاث خلايا تحتوي على نفس القيمة.",
    "howToPlayAnswer4.3": "الأحاديات المخفية: تُستخدم هذه التقنية للعثور على القيم التي هي القيمة الوحيدة الممكنة لخلية ما، حتى لو لم تكن القيمة الوحيدة الممكنة لأي خلية أخرى في نفس الصف أو العمود أو الصندوق.",
    "howToPlayAnswer5": "كن صبورًا ومثابرًا. يمكن أن تكون ألغاز السودوكو صعبة، ولكن حلها مجزٍ للغاية. إذا علقت، خذ استراحة وعد إلى الأحجية لاحقًا. مع الممارسة، ستصبح أسرع وأكثر مهارة في حل ألغاز السودوكو.",
    "additionalInfo": "نصائح إضافية لحل ألغاز السودوكو:",
    "additionalInfoAnswer1": "ابدأ بأسهل الألغاز. مع اكتسابك المزيد من الخبرة، يمكنك تجربة ألغاز أكثر صعوبة.",
    "additionalInfoAnswer2": "خذ استراحات. إذا علقت، خذ استراحة وعد إلى الأحجية لاحقًا.",
    "additionalInfoAnswer3": "استخدم قلم رصاص. ستساعدك علامات القلم الرصاص في تتبع القيم المحتملة لكل خلية.",
    "additionalInfoAnswer4": "لا تخف من ارتكاب الأخطاء. الجميع يرتكب أخطاء عند حل ألغاز السودوكو. فقط تعلم من أخطائك واستمر.",
    "additionalInfoAnswer5": "استمتع! ألغاز السودوكو هي طريقة رائعة لتحدي عقلك والاستمتاع في نفس الوقت."
  }
}
