{
    "introduceSudoku": {
      "title": "সুডোকু খেলায় স্বাগতম",
      "whatIsSudoku": "সুডোকু কি?",
      "answer": "সুডোকু হল একটি যুক্তি-ভিত্তিক, সংযোজনমূলক সংখ্যা-স্থাপন ধাঁধা। ক্লাসিক সুডোকুতে, উদ্দেশ্য হল 9×9 গ্রিড সংখ্যা দিয়ে পূরণ করা যাতে প্রতিটি কলাম, প্রতিটি সারি এবং গ্রিড গঠনকারী নয়টি 3×3 সাব-গ্রিড (যাকে 'বক্স', 'ব্লক' বা 'অঞ্চল'ও বলা হয়) 1 থেকে 9 পর্যন্ত সব সংখ্যা ধারণ করে। ধাঁধা রচয়িতা একটি আংশিক পূরণ করা গ্রিড প্রদান করেন, যা একটি সুনির্দিষ্ট ধাঁধার জন্য একটি একক সমাধান রয়েছে।",
      "ruleOfSudoku": "সুডোকুর নিয়মাবলী",
      "rule1": "নয়টি 3x3 সাব-বক্সের প্রতিটিতে 1-9 সংখ্যাগুলি থাকতে হবে, পুনরাবৃত্তি ছাড়া",
      "rule2": "প্রতিটি সারিতে 1-9 সংখ্যাগুলি থাকতে হবে, পুনরাবৃত্তি ছাড়া",
      "rule3": "প্রতিটি কলামে 1-9 সংখ্যাগুলি থাকতে হবে, পুনরাবৃত্তি ছাড়া",
      "rule4": "নয়টি 3x3 সাব-বক্সের প্রতিটিতে 1-9 সংখ্যাগুলি থাকতে হবে, পুনরাবৃত্তি ছাড়া",
      "rule5": "1-9 সংখ্যাগুলি প্রতিটি সারি, কলাম এবং 3x3 সাব-বক্সে ঠিক একবার দেখা যাবে",
      "howToPlay": "কিভাবে খেলতে হয়",
      "howToPlayAnswer1": "সহজ সংখ্যার জন্য ধাঁধাটি স্ক্যান করুন। এমন সারি, কলাম বা বক্স খুঁজুন যেখানে একটি সেলের জন্য শুধুমাত্র একটি সম্ভাব্য মান রয়েছে। এগুলিকে 'সিঙ্গেলস' বলা হয়। এই সেলগুলি উপযুক্ত সংখ্যা দিয়ে পূরণ করুন।",
      "howToPlayAnswer2": "প্রতিটি সেলের সম্ভাব্য মান নোট করার জন্য পেন্সিল মার্ক ব্যবহার করুন। ধাঁধা সমাধান করার সময়, আপনি এমন সেল পেতে পারেন যেখানে একাধিক সম্ভাব্য মান রয়েছে। এই সেলগুলিতে পেন্সিল মার্ক করুন যাতে আপনি সম্ভাবনাগুলি মনে রাখতে পারেন।",
      "howToPlayAnswer3": "অসম্ভব মান বাদ দেওয়ার জন্য যুক্তি ব্যবহার করুন। এমন সেল খুঁজুন যেখানে একটি নির্দিষ্ট মান রাখা যাবে না কারণ এটি সুডোকুর নিয়ম লঙ্ঘন করবে। উদাহরণস্বরূপ, যদি একটি সারিতে ইতিমধ্যে 1, 2 এবং 3 সংখ্যা থাকে, তাহলে সেই সারির অন্য কোনও সেলে এই সংখ্যাগুলি থাকতে পারে না।",
      "howToPlayAnswer4": "ধাঁধা সমাধান করতে উন্নত কৌশল ব্যবহার করুন। সুডোকু ধাঁধা সমাধান করতে আপনি যত বেশি অভিজ্ঞ হবেন, আপনি উন্নত কৌশল শিখতে পারেন যা আপনাকে সবচেয়ে কঠিন ধাঁধাও সমাধান করতে সাহায্য করতে পারে। এই কৌশলগুলির মধ্যে কয়েকটি হল:",
      "howToPlayAnswer4.1": "X-Wing: এই কৌশলটি ব্যবহার করা হয় একই মান সম্বলিত দুটি সেলের সাথে একই সারি বা কলামে থাকা সেলগুলিতে অসম্ভব মান বাদ দেওয়ার জন্য।",
      "howToPlayAnswer4.2": "Swordfish: এই কৌশলটি ব্যবহার করা হয় একই মান সম্বলিত তিনটি সেলের সাথে একই বক্সে থাকা সেলগুলিতে অসম্ভব মান বাদ দেওয়ার জন্য।",
      "howToPlayAnswer4.3": "Hidden Singles: এই কৌশলটি ব্যবহার করা হয় এমন মান খুঁজে বের করার জন্য যা একটি সেলের জন্য একমাত্র সম্ভাব্য মান, যদিও এটি একই সারি, কলাম বা বক্সের অন্য কোনও সেলের জন্য একমাত্র সম্ভাব্য মান নয়।",
      "howToPlayAnswer5": "ধৈর্যশীল এবং অধ্যবসায়ী হোন। সুডোকু ধাঁধা চ্যালেঞ্জিং হতে পারে, কিন্তু সেগুলি সমাধান করা খুবই সন্তোষজনক। যদি আপনি আটকে যান, একটু বিরতি নিন এবং পরে ধাঁধায় ফিরে আসুন। অনুশীলনের মাধ্যমে, আপনি সুডোকু ধাঁধা সমাধান করতে আরও দ্রুত এবং দক্ষ হয়ে উঠবেন।",
      "additionalInfo": "সুডোকু ধাঁধা সমাধানের জন্য অতিরিক্ত টিপস:",
      "additionalInfoAnswer1": "সবচেয়ে সহজ ধাঁধা দিয়ে শুরু করুন। আপনি যত বেশি অভিজ্ঞ হবেন, তত বেশি কঠিন ধাঁধা চেষ্টা করতে পারেন।",
      "additionalInfoAnswer2": "বিরতি নিন। যদি আপনি আটকে যান, একটু বিরতি নিন এবং পরে ধাঁধায় ফিরে আসুন।",
      "additionalInfoAnswer3": "পেন্সিল ব্যবহার করুন। পেন্সিল মার্ক আপনাকে প্রতিটি সেলের সম্ভাব্য মানগুলি ট্র্যাক করতে সাহায্য করবে।",
      "additionalInfoAnswer4": "ভুল করতে ভয় পাবেন না। সুডোকু ধাঁধা সমাধান করার সময় সবাই ভুল করে। শুধু আপনার ভুল থেকে শিখুন এবং এগিয়ে যান।",
      "additionalInfoAnswer5": "মজা করুন! সুডোকু ধাঁধা আপনার মনকে চ্যালেঞ্জ করার এবং একই সাথে কিছুটা মজা করার একটি দুর্দান্ত উপায়।"
    }
  }


