{
    "introduceSudoku": {
      "title": "सुडोकु खेल में आपका स्वागत है",
      "whatIsSudoku": "सुडोकु क्या है",
      "answer": "सुडोकु एक तर्क-आधारित, संयोजनात्मक संख्या-स्थापन पहेली है। क्लासिक सुडोकु में, उद्देश्य 9×9 ग्रिड को अंकों से भरना है ताकि प्रत्येक कॉलम, प्रत्येक पंक्ति, और ग्रिड को बनाने वाले नौ 3×3 उप-ग्रिड (जिन्हें 'बॉक्स', 'ब्लॉक', या 'क्षेत्र' भी कहा जाता है) में 1 से 9 तक के सभी अंक हों। पहेली निर्माता एक आंशिक रूप से पूरा किया गया ग्रिड प्रदान करता है, जो एक अच्छी तरह से रखी गई पहेली के लिए एक अद्वितीय समाधान है।",
      "ruleOfSudoku": "सुडोकु के नियम",
      "rule1": "नौ 3x3 उप-बॉक्स में से प्रत्येक में 1-9 की संख्याएँ होनी चाहिए, बिना दोहराव के",
      "rule2": "प्रत्येक पंक्ति में 1-9 की संख्याएँ होनी चाहिए, बिना दोहराव के",
      "rule3": "प्रत्येक कॉलम में 1-9 की संख्याएँ होनी चाहिए, बिना दोहराव के",
      "rule4": "नौ 3x3 उप-बॉक्स में से प्रत्येक में 1-9 की संख्याएँ होनी चाहिए, बिना दोहराव के",
      "rule5": "1-9 की संख्याएँ प्रत्येक पंक्ति, कॉलम और 3x3 उप-बॉक्स में ठीक एक बार दिखाई देनी चाहिए",
      "howToPlay": "कैसे खेलें",
      "howToPlayAnswer1": "आसान संख्याओं के लिए पहेली को स्कैन करें। ऐसी पंक्तियाँ, कॉलम, या बॉक्स खोजें जिनमें किसी सेल के लिए केवल एक संभावित मान हो। इन्हें 'सिंगल्स' कहा जाता है। इन सेलों को उपयुक्त संख्याओं से भरें।",
      "howToPlayAnswer2": "प्रत्येक सेल के लिए संभावित मानों को नोट करने के लिए पेंसिल मार्क का उपयोग करें। जैसे-जैसे आप पहेली को हल करते हैं, आपको ऐसे सेल मिल सकते हैं जिनमें एक से अधिक संभावित मान हों। इन सेलों को पेंसिल मार्क से चिह्नित करें ताकि आप संभावनाओं को याद रख सकें।",
      "howToPlayAnswer3": "असंभव मानों को हटाने के लिए तर्क का उपयोग करें। ऐसे सेल खोजें जहाँ किसी निश्चित मान को नहीं रखा जा सकता क्योंकि यह सुडोकु के नियमों का उल्लंघन करेगा। उदाहरण के लिए, यदि किसी पंक्ति में पहले से ही अंक 1, 2 और 3 हैं, तो उस पंक्ति के किसी अन्य सेल में ये अंक नहीं हो सकते।",
      "howToPlayAnswer4": "पहेली को हल करने के लिए उन्नत तकनीकों का उपयोग करें। जैसे-जैसे आप सुडोकु पहेलियाँ हल करने में अधिक अनुभवी होते जाते हैं, आप उन्नत तकनीकें सीख सकते हैं जो आपको सबसे कठिन पहेलियाँ भी हल करने में मदद कर सकती हैं। इनमें से कुछ तकनीकें हैं:",
      "howToPlayAnswer4.1": "X-Wing: इस तकनीक का उपयोग उन सेलों में असंभव मानों को हटाने के लिए किया जाता है जो समान मान वाले दो सेलों के साथ एक ही पंक्ति या कॉलम में हैं।",
      "howToPlayAnswer4.2": "Swordfish: इस तकनीक का उपयोग उन सेलों में असंभव मानों को हटाने के लिए किया जाता है जो समान मान वाले तीन सेलों के साथ एक ही बॉक्स में हैं।",
      "howToPlayAnswer4.3": "छिपे हुए सिंगल्स: इस तकनीक का उपयोग उन मानों को खोजने के लिए किया जाता है जो किसी सेल के लिए एकमात्र संभव मान हैं, भले ही वे उसी पंक्ति, कॉलम या बॉक्स में किसी अन्य सेल के लिए एकमात्र संभव मान न हों।",
      "howToPlayAnswer5": "धैर्यवान और दृढ़ रहें। सुडोकु पहेलियाँ चुनौतीपूर्ण हो सकती हैं, लेकिन उन्हें हल करना बहुत संतोषजनक भी होता है। यदि आप अटक जाते हैं, तो ब्रेक लें और बाद में पहेली पर वापस आएँ। अभ्यास के साथ, आप सुडोकु पहेलियाँ हल करने में तेज और अधिक कुशल हो जाएंगे।",
      "additionalInfo": "सुडोकु पहेलियाँ हल करने के लिए अतिरिक्त सुझाव:",
      "additionalInfoAnswer1": "सबसे आसान पहेलियों से शुरुआत करें। जैसे-जैसे आप अधिक अनुभवी होते जाएंगे, आप अधिक कठिन पहेलियाँ आजमा सकते हैं।",
      "additionalInfoAnswer2": "ब्रेक लें। यदि आप अटक जाते हैं, तो ब्रेक लें और बाद में पहेली पर वापस आएँ।",
      "additionalInfoAnswer3": "पेंसिल का उपयोग करें। पेंसिल मार्क आपको प्रत्येक सेल के लिए संभावित मानों का ट्रैक रखने में मदद करेंगे।",
      "additionalInfoAnswer4": "गलतियाँ करने से डरें नहीं। सुडोकु पहेलियाँ हल करते समय हर कोई गलतियाँ करता है। बस अपनी गलतियों से सीखें और आगे बढ़ें।",
      "additionalInfoAnswer5": "मजे करें! सुडोकु पहेलियाँ अपने दिमाग को चुनौती देने और साथ ही मजे करने का एक शानदार तरीका हैं।"
    }
  }
