{
    "introduceSudoku": {
      "title": "Добро пожаловать в игру Судоку",
      "whatIsSudoku": "Что такое Судоку?",
      "answer": "Судоку - это логическая комбинаторная головоломка с цифрами. В классическом Судоку цель состоит в том, чтобы заполнить сетку 9×9 цифрами так, чтобы каждый столбец, каждая строка и каждая из девяти подсеток 3×3, составляющих сетку (также называемых 'квадратами', 'блоками' или 'регионами'), содержали все цифры от 1 до 9. Составитель головоломки предоставляет частично заполненную сетку, которая для правильно составленной головоломки имеет единственное решение.",
      "ruleOfSudoku": "Правила Судоку",
      "rule1": "Каждый из девяти квадратов 3x3 должен содержать цифры от 1 до 9 без повторений",
      "rule2": "Каждая строка должна содержать цифры от 1 до 9 без повторений",
      "rule3": "Каждый столбец должен содержать цифры от 1 до 9 без повторений",
      "rule4": "Каждый из девяти квадратов 3x3 должен содержать цифры от 1 до 9 без повторений",
      "rule5": "Цифры от 1 до 9 должны появляться ровно один раз в каждой строке, столбце и квадрате 3x3",
      "howToPlay": "Как играть",
      "howToPlayAnswer1": "Просканируйте головоломку на наличие легких цифр. Ищите строки, столбцы или квадраты, которые имеют только одно возможное значение для ячейки. Это называется 'одиночками'. Заполните эти ячейки соответствующими цифрами.",
      "howToPlayAnswer2": "Используйте карандашные отметки, чтобы отмечать возможные значения для каждой ячейки. По мере решения головоломки вы можете столкнуться с ячейками, которые имеют более одного возможного значения. Отметьте эти ячейки карандашом, чтобы помнить о возможностях.",
      "howToPlayAnswer3": "Используйте логику, чтобы исключить невозможные значения. Ищите ячейки, где определенное значение не может быть размещено, потому что это нарушит правила Судоку. Например, если строка уже содержит цифры 1, 2 и 3, то ни одна другая ячейка в этой строке не может содержать эти цифры.",
      "howToPlayAnswer4": "Используйте продвинутые техники для решения головоломки. По мере того, как вы становитесь более опытным в решении головоломок Судоку, вы можете изучить продвинутые техники, которые помогут вам решать даже самые сложные головоломки. Некоторые из этих техник включают:",
      "howToPlayAnswer4.1": "X-Wing: Эта техника используется для исключения невозможных значений в ячейках, которые находятся в той же строке или столбце, что и две ячейки, содержащие одно и то же значение.",
      "howToPlayAnswer4.2": "Swordfish: Эта техника используется для исключения невозможных значений в ячейках, которые находятся в том же квадрате, что и три ячейки, содержащие одно и то же значение.",
      "howToPlayAnswer4.3": "Скрытые одиночки: Эта техника используется для нахождения значений, которые являются единственно возможным значением для ячейки, даже если они не являются единственно возможным значением для любой другой ячейки в той же строке, столбце или квадрате.",
      "howToPlayAnswer5": "Будьте терпеливы и настойчивы. Головоломки Судоку могут быть сложными, но их решение очень увлекательно. Если вы застряли, сделайте перерыв и вернитесь к головоломке позже. С практикой вы станете быстрее и искуснее в решении головоломок Судоку.",
      "additionalInfo": "Дополнительные советы по решению головоломок Судоку:",
      "additionalInfoAnswer1": "Начните с самых легких головоломок. По мере приобретения опыта вы можете попробовать более сложные головоломки.",
      "additionalInfoAnswer2": "Делайте перерывы. Если вы застряли, сделайте перерыв и вернитесь к головоломке позже.",
      "additionalInfoAnswer3": "Используйте карандаш. Карандашные отметки помогут вам отслеживать возможные значения для каждой ячейки.",
      "additionalInfoAnswer4": "Не бойтесь делать ошибки. Все делают ошибки при решении головоломок Судоку. Просто учитесь на своих ошибках и двигайтесь дальше.",
      "additionalInfoAnswer5": "Получайте удовольствие! Головоломки Судоку - отличный способ бросить вызов своему уму и одновременно развлечься."
    }
  }
