{
  "introduceSudoku": {
    "title": "سوڈوکو کھیل میں خوش آمدید",
    "whatIsSudoku": "سوڈوکو کیا ہے؟",
    "answer": "سوڈوکو ایک منطق پر مبنی، ترکیبی نمبر-پلیسمنٹ پزل ہے۔ کلاسیک سوڈوکو میں، مقصد 9×9 کے گرڈ کو اعداد سے بھرنا ہے تاکہ ہر کالم، ہر قطار، اور نو 3×3 ذیلی گرڈز جو گرڈ کو تشکیل دیتے ہیں (جنہیں 'خانے'، 'بلاکس'، یا 'علاقے' بھی کہا جاتا ہے) میں 1 سے 9 تک کے تمام اعداد شامل ہوں۔ پزل بنانے والا ایک جزوی طور پر مکمل گرڈ فراہم کرتا ہے، جس کا ایک اچھی طرح سے رکھے گئے پزل کے لیے صرف ایک حل ہوتا ہے۔",
    "ruleOfSudoku": "سوڈوکو کے قواعد",
    "rule1": "نو 3x3 ذیلی خانوں میں سے ہر ایک میں 1-9 کے اعداد ہونے چاہئیں، بغیر کسی تکرار کے",
    "rule2": "ہر قطار میں 1-9 کے اعداد ہونے چاہئیں، بغیر کسی تکرار کے",
    "rule3": "ہر کالم میں 1-9 کے اعداد ہونے چاہئیں، بغیر کسی تکرار کے",
    "rule4": "نو 3x3 ذیلی خانوں میں سے ہر ایک میں 1-9 کے اعداد ہونے چاہئیں، بغیر کسی تکرار کے",
    "rule5": "1-9 کے اعداد ہر قطار، کالم، اور 3x3 ذیلی خانے میں صرف ایک بار ظاہر ہونے چاہئیں",
    "howToPlay": "کیسے کھیلیں",
    "howToPlayAnswer1": "آسان اعداد کے لیے پزل کو اسکین کریں۔ ایسی قطاریں، کالم، یا خانے تلاش کریں جن میں کسی خلیے کے لیے صرف ایک ممکنہ قیمت ہو۔ انہیں 'سنگلز' کہا جاتا ہے۔ ان خلیوں کو مناسب اعداد سے بھریں۔",
    "howToPlayAnswer2": "ہر خلیے کے لیے ممکنہ اقدار کو نوٹ کرنے کے لیے پنسل کے نشانات کا استعمال کریں۔ جیسے جیسے آپ پزل حل کرتے ہیں، آپ کو ایسے خلیے مل سکتے ہیں جن میں ایک سے زیادہ ممکنہ قیمتیں ہوں۔ ان خلیوں کو پنسل کے نشانات سے نشان زد کریں تاکہ آپ کو امکانات یاد رہیں۔",
    "howToPlayAnswer3": "ناممکن اقدار کو خارج کرنے کے لیے منطق کا استعمال کریں۔ ایسے خلیے تلاش کریں جہاں کسی خاص قیمت کو نہیں رکھا جا سکتا کیونکہ یہ سوڈوکو کے قواعد کی خلاف ورزی کرے گا۔ مثال کے طور پر، اگر کسی قطار میں پہلے سے ہی 1، 2، اور 3 کے اعداد موجود ہیں، تو اس قطار کے کسی دوسرے خلیے میں یہ اعداد نہیں ہو سکتے۔",
    "howToPlayAnswer4": "پزل کو حل کرنے کے لیے اعلی تکنیکوں کا استعمال کریں۔ جیسے جیسے آپ سوڈوکو پزلز کو حل کرنے میں زیادہ تجربہ کار ہوتے جائیں گے، آپ اعلی تکنیکیں سیکھ سکتے ہیں جو آپ کو سب سے مشکل پزلز کو بھی حل کرنے میں مدد کر سکتی ہیں۔ ان تکنیکوں میں شامل ہیں:",
    "howToPlayAnswer4.1": "X-Wing: یہ تکنیک ان خلیوں میں ناممکن اقدار کو خارج کرنے کے لیے استعمال کی جاتی ہے جو دو ایسے خلیوں کے ساتھ ایک ہی قطار یا کالم میں ہیں جن میں ایک ہی قیمت ہو۔",
    "howToPlayAnswer4.2": "Swordfish: یہ تکنیک ان خلیوں میں ناممکن اقدار کو خارج کرنے کے لیے استعمال کی جاتی ہے جو تین ایسے خلیوں کے ساتھ ایک ہی خانے میں ہیں جن میں ایک ہی قیمت ہو۔",
    "howToPlayAnswer4.3": "پوشیدہ سنگلز: یہ تکنیک ان اقدار کو تلاش کرنے کے لیے استعمال کی جاتی ہے جو کسی خلیے کے لیے واحد ممکنہ قیمت ہیں، حالانکہ وہ اسی قطار، کالم، یا خانے میں کسی دوسرے خلیے کے لیے واحد ممکنہ قیمت نہیں ہیں۔",
    "howToPlayAnswer5": "صبر اور استقامت سے کام لیں۔ سوڈوکو پزلز چیلنجنگ ہو سکتے ہیں، لیکن انہیں حل کرنا بہت فائدہ مند بھی ہوتا ہے۔ اگر آپ پھنس جائیں، تو وقفہ لیں اور بعد میں پزل پر واپس آئیں۔ مشق کے ساتھ، آپ سوڈوکو پزلز کو حل کرنے میں تیز اور زیادہ ماہر ہو جائیں گے۔",
    "additionalInfo": "سوڈوکو پزلز کو حل کرنے کے لیے اضافی نکات:",
    "additionalInfoAnswer1": "سب سے آسان پزلز سے شروع کریں۔ جیسے جیسے آپ زیادہ تجربہ کار ہوتے جائیں گے، آپ زیادہ مشکل پزلز کی کوشش کر سکتے ہیں۔",
    "additionalInfoAnswer2": "وقفے لیں۔ اگر آپ پھنس جائیں، تو وقفہ لیں اور بعد میں پزل پر واپس آئیں۔",
    "additionalInfoAnswer3": "پنسل کا استعمال کریں۔ پنسل کے نشانات آپ کو ہر خلیے کے لیے ممکنہ اقدار کا حساب رکھنے میں مدد کریں گے۔",
    "additionalInfoAnswer4": "غلطیاں کرنے سے نہ ڈریں۔ سوڈوکو پزلز کو حل کرتے وقت ہر کوئی غلطیاں کرتا ہے۔ بس اپنی غلطیوں سے سیکھیں اور آگے بڑھیں۔",
    "additionalInfoAnswer5": "مزہ لیں! سوڈوکو پزلز آپ کے ذہن کو چیلنج کرنے اور ساتھ ہی کچھ مزہ لینے کا ایک بہترین طریقہ ہیں۔"
  }
}
