import React from 'react';

export const Introduce = () => {
    return (
        <div>
            <h2>数独游戏介绍</h2>
            <p>
                <br />
                数独是一款经典的逻辑游戏，起源于 19 世纪的瑞士。游戏的目标是将数字从 1 到 9
                填入一个 9x9 的网格中，使得每一行、每一列和每个 3x3 的子网格都包含数字 1 到
                9，且不重复。
                <br />
                <br />
                数独游戏通常会给定一些数字作为提示，玩家需要根据这些提示来推导出其他数字。数独游戏有许多不同的难度等级，从简单到困难不等，适合不同水平的玩家。
                <br />
                <br />
                数独游戏不仅可以锻炼逻辑思维能力，还可以帮助人们放松身心。如果您正在寻找一款益智游戏来打发时间，那么数独是一个不错的选择。
            </p>
        </div>
    )
}

